[
  {
    "restaurantName": "Room Cafe",
    "tag": "Room Cafe - VI (Victoria Island), Lagos Chic ambiance, delicious food and drinks, with room for service improvement; budget of 30000 per person, located on the island",
    "summary": "The Room Cafe, located at 190b Prince Ade Odedina Street in Victoria Island, offers a lovely atmosphere with modern and stylish decor. The food is enjoyable with a good variety of dishes, and the drinks are well made. However, the service can be slow and could use some improvement. Overall, if you're looking for a nice place to grab a bite and relax, the Room Cafe is definitely worth considering, and it's budget-friendly at 30000 Naira per person. Being located on the island adds to its appeal as a dining option in Lagos. Contact them at 0908 285 1609."
  },
  {
    "restaurantName": "Smalliez Diner ",
    "tag": "Smalliez Diner - VI (Victoria Island), Vibrant atmosphere, generous portions, friendly service, budget of 20000 per person, located on the island.",
    "summary": "Located in the heart of Victoria Island, Smalliez Diner is a must-visit for those seeking a vibrant and inviting atmosphere for a casual dining experience. With a diverse menu that includes mouthwatering burgers and flavorful pasta dishes, Smalliez Diner offers generous portions that are sure to satisfy even the heartiest appetite. The service is prompt and friendly, enhancing the overall dining experience. However, some diners have noted that a few of the dishes were under-seasoned and lacked the wow factor. Despite this, Smalliez Diner remains a budget-friendly option, with an average cost of 20000 Naira per person. Situated on the island, it's a convenient choice for locals and tourists alike who are looking for a laid-back spot to enjoy a meal with friends or loved ones."
  },
  {
    "restaurantName": "Safron Restaurant ",
    "tag": "Saffron Restaurant - Ikeja: Pleasant dining experience, lovely ambience, well-prepared food, friendly service; budget of 30000 per person, located on the mainland.",
    "summary": "Located in the bustling Ikeja GRA, Saffron Restaurant offers a delightful dining experience with its charming ambience and stylish decor. The service is prompt and friendly, ensuring a seamless dining experience from start to finish. The menu at Saffron Restaurant boasts a good variety of dishes to cater to different tastes, and the well-prepared food is bursting with flavor, with generous portions that are sure to satisfy even the hungriest of diners. The drinks selection is also noteworthy, with a decent array of wines and cocktails to complement your meal. With a budget-friendly average cost of 30000 Naira per person, Saffron Restaurant is a top choice for those looking for a high-quality dining experience without breaking the bank. Plus, being located on the mainland in Ikeja, it's a convenient option for both locals and visitors to explore the culinary offerings of Lagos. Don't miss out on the chance to dine at Saffron Restaurant and indulge in its delicious cuisine and welcoming atmosphere! "
  },
  {
    "restaurantName": "Taj Restaurant | Bar",
    "tag": "Taj Restaurant & Bar - VI (Victoria Island), Lagos: Modern ambience, generous portions; budget of 24000 per person, located on the island.",
    "summary": "Situated in the bustling Victoria Island, Taj Restaurant & Bar offers a dining experience with a modern and elegant ambience that is sure to impress. The restaurant's decor is lovely, creating a welcoming atmosphere for diners. The menu at Taj Restaurant & Bar is diverse, offering a variety of Indian, Chinese, and continental dishes to satisfy different palates. The portions are generous, ensuring you won't leave hungry. The staff are friendly, attentive, and always willing to assist, adding to the overall positive dining experience. However, while the food is decent, it may not meet the high expectations of those seeking authentic Indian cuisine, as some dishes lacked the expected flavors. The drinks are average, with cocktails that were not particularly impressive. With an average cost of 24000 Naira per person, Taj Restaurant & Bar is a budget-friendly option for those looking to dine on the island in Victoria Island. Despite some minor shortcomings, Taj Restaurant & Bar is worth a visit for a decent dining experience in a modern and welcoming setting."
  },
  {
    "restaurantName": "Placebo Restaurant & Bar",
    "tag": "Placebo Restaurant & Bar - Magodo: Nice ambience, decent food with highlights on chicken wings and pepper soup, budget of 18000 per person, located on the mainland.",
    "summary": "Placebo Restaurant & Bar in Magodo offers a nice ambience and decor, with the reviewer mentioning that the food is decent, particularly highlighting the chicken wings and pepper soup. However, the service was reported to be slow and the prices were considered slightly high at 18000 Naira per person. Despite these issues, if you're looking for a nice atmosphere and decent food, Placebo Restaurant & Bar in Magodo may still be worth a visit. It is located on the mainland."
  },
  {
    "restaurantName": "Gusto",
    "tag": "Gusto - VI (Victoria Island), Lagos: Stylish interior, diverse menu, reasonable pricing; budget-friendly at 25000 per person, located on the island",
    "summary": "Gusto in Victoria Island offers a stylish and spacious interior with modern decor, and a diverse menu featuring Italian classics and fusion cuisine. The service is prompt and attentive, and the pricing is reasonable. However, the food quality is average, with some dishes lacking in flavor due to being under-seasoned. Overall, while the atmosphere and service are commendable, the food may not live up to expectations for some diners. Nevertheless, it can still be considered as a budget-friendly option for dining out at 25000 Naira per person, especially for those looking for a trendy spot on the island."
  },
  {
    "restaurantName": "Kaanubaru",
    "tag": "Kaanubaru - Gbagada: Tasty well-seasoned food, prompt service, nice decor and ambiance, budget of 30000 per person, located on the mainland.",
    "summary": "Kaanubaru in Gbagada is praised for its tasty and well-seasoned food, prompt and attentive service, and nice decor and ambiance. With a budget of 30000 Naira per person, Kaanubaru offers a good dining experience for those looking for a restaurant on the mainland. The reviewer's positive feedback makes it a compelling option to consider for your dining needs in Gbagada."
  },
  {
    "restaurantName": "Avant Garde by Soul Chow",
    "tag": "Avant Garde by Soul Chow - Ikoyi: Stylish interior, well-presented food, attentive service, budget of 30000 per person, located on the island.",
    "summary": "Avant Garde by Soul Chow in Ikoyi offers a modern and stylish dining experience with well-presented food, attentive service, and a variety of menu options. However, the prices are on the higher side at 35000 Naira per person. If you're looking for a chic and trendy restaurant on the island, Avant Garde by Soul Chow is worth considering."
  },
  {
    "restaurantName": "Bamboo Lounge and Guest House",
    "tag": "Bamboo Lounge and Guest House - Ikeja GRA: Great spot for drinks and chill vibe, impressive ambience with lovely outdoor seating, budget of 7500 per person, located on the mainland.",
    "summary": "Bamboo Lounge and Guest House in Ikeja GRA offers a great spot for drinks and a chill vibe, with an impressive ambience and lovely outdoor seating area. However, the food could use some improvement in terms of seasoning and cooking. The drinks are decent but not exceptional, and the service can be slow. Despite these shortcomings, if you're looking for a place to hang out and have drinks with friends, Bamboo Lounge and Guest House may be worth a visit, especially with a budget of 7500 Naira per person. Located on the mainland, it offers a convenient option for those in the Ikeja GRA area."
  },
  {
    "restaurantName": "Black Olive",
    "tag": "Black Olive - Ikoyi: Pleasant atmosphere with modern decor, comfortable seating, variety of options, budget of 15000 per person, located on the island.",
    "summary": "Black Olive in Ikoyi offers a pleasant atmosphere with modern decor and comfortable seating arrangements. The restaurant has a variety of options to choose from, making it a good choice for diners looking for a diverse menu. The budget is 15000 Naira per person, and the restaurant is located on the island."
  },
  {
    "restaurantName": "Black Pepper Steakhouse",
    "tag": "Black Pepper Steakhouse - Eko Atlantic: Modern and sophisticated ambience, good service, inconsistent food quality, limited menu options, budget of 38000 Naira per person, located on the island.",
    "summary": "Black Pepper Steakhouse at Eko Atlantic Pearl offers a modern and sophisticated ambience with good service, although food quality can be inconsistent and menu options are limited. With a budget of 38000 Naira per person, it is a recommended option for a fancy dining experience on the island, but be prepared for potential hit-or-miss dishes according to the reviewer's feedback."
  },
  {
    "restaurantName": "CAFE DE FLORE",
    "tag": "CAFE DE FLORE - Ikoyi: Beautiful atmosphere, French-inspired menu, well-prepared food, efficient service, budget of 20000 per person, located on the island.",
    "summary": "Cafe de Flore in Ikoyi, Lagos is known for its beautiful and inviting atmosphere, French-inspired menu, well-prepared food, and efficient service. Despite some dishes being overpriced and portion sizes not being generous, it is still worth considering for a pleasant and relaxed dining experience on the island, especially if you have a budget of 20000 Naira per person."
  },
  {
    "restaurantName": "Ci Gusta",
    "tag": "Ci Gusta - VI (Victoria Island): Beautiful decor, delicious Italian cuisine, generous portions, prompt service, high prices, budget of 30000 per person, located on the island.",
    "summary": "Ci Gusta in Victoria Island is a beautiful Italian restaurant with delicious and well-prepared food, generous portions, and prompt service. However, the prices are on the higher side and the outdoor seating area may not be very comfortable. Despite that, it's worth considering for a nice dining experience if you're looking for Italian cuisine on the island, with a budget of 30000 Naira per person."
  },
  {
    "restaurantName": "Cilantro",
    "tag": "Cilantro - VI (Victoria Island): Indian restaurant with pleasant ambiance and comfortable seating, budget of 12000 per person, located on the island",
    "summary": "Cilantro, located in Victoria Island, is an Indian restaurant with lovely decor, comfortable seating, and decent service. However, the food, including the chicken tikka masala and naan bread, was not up to expectations in terms of flavor and freshness. Additionally, the wait time for the food was too long. With a budget of 12000 Naira per person, Cilantro may be worth a visit for its ambiance, but the food quality could be improved according to the reviewer's feedback."
  },
  {
    "restaurantName": "Crust Cafe",
    "tag": "Crust Cafe - Lekki: Casual and welcoming atmosphere, variety of dishes including sandwiches, salads, and pastries, reasonable prices and generous portions, budget of 12000 per person located on the island.",
    "summary": "Crust Cafe in Lekki offers a casual and welcoming atmosphere, with a variety of dishes including sandwiches, salads, and pastries, at reasonable prices and generous portions. Although service may be slow during peak hours, it's a great spot for a relaxed and laid-back dining experience in Lekki Phase I."
  },
  {
    "restaurantName": "CREPAWAY",
    "tag": "CREPAWAY - VI (Victoria Island): Nice ambience, trendy decor, decent food, friendly service, reasonable prices, located on the island with a budget of 15000 per person.",
    "summary": "CREPAWAY in Victoria Island offers a nice ambience with trendy decor, serves decent food with friendly service, and reasonable prices. Located on the island with a budget of 15000 Naira per person, it could be a good casual dining spot for those looking for a restaurant with a good vibe."
  },
  {
    "restaurantName": "HOV Lounge",
    "tag": "HOV Lounge - Lekki Phase I: Pleasant ambiance, but subpar food and drinks, slow service, budget of 30000 per person, located on the island.",
    "summary": "HOV Lounge in Lekki Phase I offers a pleasant ambiance, but the quality of food and drinks may not meet expectations, with overcooked seafood, poorly made cocktails, and slow service. It may be worth considering for the ambiance, but other options may be preferable if food and drinks are a priority. The budget is around 30000 Naira per person, and it is located on the island."
  },
  {
    "restaurantName": "Godaïf Village",
    "tag": "Godaïf Village - Ikoyi: Nice ambiance and decor, friendly staff, concerns about food quality, budget of 20000 Naira per person, located on the island.",
    "summary": "Godaïf Village, located in Ikoyi, is praised for its nice ambiance and decor, as well as friendly and attentive staff. However, there are concerns about food quality with some dishes being underwhelming and lacking flavor, and prices being on the higher side. If you prioritize ambiance and decor over food quality, Godaïf Village could be worth a visit within a budget of 20000 Naira per person, but if food quality is a top priority for you, you may want to consider other options."
  },
  {
    "restaurantName": "HSE Gourmet",
    "tag": "HSE Gourmet - Lekki Phase I: Classy ambiance, underwhelming food, average service, budget of 40000 per person, located on the island.",
    "summary": "HSE Gourmet in Lekki Phase I is known for its classy and elegant ambiance, but the food may be underwhelming with lacking flavors and poorly made cocktails. The service is average, and the budget is around 40000 Naira per person. It is located on the island, and if you prioritize ambiance over food quality, HSE Gourmet may be worth considering for your dining experience in Lekki Phase I."
  },
  {
    "restaurantName": "ILÉ EROS",
    "tag": "ILÉ EROS - Lekki Phase I: Unique dining experience with beautiful decor and ambiance, Average food quality, prompt service, budget of 15000 per person, located on the island.",
    "summary": "ILÉ EROS in Lekki Phase I offers a unique dining experience with its beautiful decor and ambiance, although the food quality was average during our visit. The service was prompt and attentive, but prices were on the higher side. With a budget of 15000 Naira per person, ILÉ EROS could be worth a try for those looking for a restaurant with a good ambiance on the island."
  },
  {
    "restaurantName": "Indigo Bar Restaurant & Suite",
    "tag": "Indigo Bar Restaurant & Suite - VI (Victoria Island): Modern and chic decor, impressive menu selection, well-prepared food, extensive drinks menu, attentive service, budget of 20000 per person, located on the island.",
    "summary": "Indigo Bar Restaurant & Suite in Victoria Island offers a modern and chic ambiance, an impressive menu selection, well-prepared and delicious food, an extensive drinks menu, and attentive service. With a budget of 20000 Naira per person, it is a great option for those looking for a good dining experience in Victoria Island."
  },
  {
    "restaurantName": "Kaly Restaurant & Bar Lounge",
    "tag": "Kaly Restaurant & Bar Lounge - VI (Victoria Island): Great atmosphere, delicious food, well-made drinks, prompt service, located on the island with a budget of 50000 Naira per person.",
    "summary": "Kaly Restaurant & Bar Lounge in Victoria Island offers a great atmosphere with an outdoor seating area that offers a nice view. The food, particularly the grilled chicken, is delicious, and the drinks are well-made. The service is prompt and attentive, making it a good choice for a nice spot to hang out with friends or have a casual date. With a budget of 50000 Naira per person, Kaly is a good option for those looking for a restaurant on the island."
  },
  {
    "restaurantName": "Ki Bar & Kitchen",
    "tag": "Ki Lagos - VI (Victoria Island): Pleasant ambiance, flavorful food, attentive service, with prices on the higher side, budget of 16000 Naira per person, located on the island.",
    "summary": "Ki Lagos in Victoria Island is known for its pleasant ambiance, flavorful food, and attentive service. The restaurant offers a comfortable seating arrangement with an impressive decor, and the food is well-presented and of good quality. However, it is noted that the prices are on the higher side. If you're looking for a restaurant with a nice atmosphere and good food, Ki Lagos may be worth a visit for those with a budget of 16000 Naira per person. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Kuramo Sports Cafe",
    "tag": "Kuramo Sports Cafe - VI (Victoria Island): Modern and spacious atmosphere with a diverse food selection including well-prepared grilled items, extensive drink options, and prompt and attentive service. Budget of 13000 Naira per person. Located on the island.",
    "summary": "Kuramo Sports Cafe at Eko Hotel in Victoria Island offers a modern and spacious atmosphere with indoor and outdoor seating options. The restaurant's diverse food selection includes a mix of local and international dishes, with the grilled items being particularly well-prepared and flavorful. While some of the other dishes may not be up to the same level of quality, the extensive drink options make up for it. The service is prompt and attentive, making for an overall pleasant dining experience. If you're in the area and looking for a place to grab a bite, Kuramo Sports Cafe is worth a visit with a budget of 13000 Naira per person. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "La Chaumiere",
    "tag": "La Chaumiere - VI (Victoria Island): Charming and sophisticated ambiance with a variety of well-prepared and flavorful French dishes. Impressive wine list, attentive and knowledgeable service. Budget of 25000 Naira per person. Located on the island.",
    "summary": "La Chaumiere in Victoria Island is a charming and sophisticated French restaurant that exudes a French vibe. The tasteful decor and comfortable seating arrangements provide a pleasant dining experience. The menu offers a variety of well-prepared and flavorful French dishes, with an impressive wine list featuring a good selection of French wines. The attentive and friendly service adds to the experience, and the staff are knowledgeable about the menu. Overall, La Chaumiere is highly recommended for a delightful French dining experience with a budget of 25000 Naira per person. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Maple Restaurant",
    "tag": "Maple - Lekki Phase I: Tasteful and elegant decor with an inviting atmosphere. Menu features a variety of dishes with impressive presentation. Prompt and attentive service. Some items are pricey with portion sizes not very generous. Budget of 16000 Naira per person. Located on the island.",
    "summary": "Maple Restaurant in Lekki Phase I has a tasteful and elegant decor with an inviting atmosphere that provides a sophisticated dining experience. The menu offers a variety of dishes ranging from seafood to grilled meats, with an impressive presentation of the food. The prompt and attentive service ensures an enjoyable dining experience. However, some items on the menu are a bit pricey, and the portion sizes could be more generous. Overall, Maple Restaurant is worth a visit for those with a budget of 16000 Naira per person. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Moonshine Cafe",
    "tag": "Moonshine Cafe - Lekki Phase I: Lovely and inviting atmosphere with a rustic interior, diverse menu with well-prepared and tasty food, good selection of cocktails and beverages, prompt and attentive service. Budget of 20000 Naira per person. Located on the island.",
    "summary": "Moonshine Cafe in Lekki Phase I has a lovely and inviting atmosphere with a rustic interior that gives off a warm and welcoming vibe. The menu is diverse, with a variety of dishes to choose from, and the food is well-prepared and tasty. The drinks are also delightful, with a good selection of cocktails and other beverages. The service is prompt and attentive, making for an overall enjoyable dining experience. I would definitely recommend visiting Moonshine for a meal or drinks with friends and family, especially for those with a budget of 20000 Naira per person. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Norma",
    "tag": "Norma Ikeja: Warm ambiance with African-European fusion dishes, attentive service, but prices can be on the higher side with a budget of 15000 Naira per person. Located on the mainland.",
    "summary": "Norma in Ikeja offers a warm and inviting atmosphere with a modern decor that creates a relaxing ambiance for diners. The menu features a variety of dishes with a fusion of African and European flavors, which are well-presented and flavorful. The service is attentive and friendly, making for an enjoyable dining experience. However, it is noted that the prices can be a bit steep for some of the dishes. If you're looking for a trendy spot with good food and service, Norma in Ikeja may be worth a visit for those with a budget of 15000 Naira per person. Located on the mainland, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Oceans5 by Riviera",
    "tag": "Oceans5 by Riviera - VI (Victoria Island): Inconsistent food and service, extensive menu, great ambiance, with a budget of 17000 Naira per person, located on the island.",
    "summary": "Oceans5 by Riviera in Victoria Island offers an extensive menu and a great ambiance. However, the food and service are inconsistent, with some dishes being well-prepared and flavorful, while others are disappointing and lack seasoning. Some staff members are friendly and attentive, while others are slow and unresponsive. For those with a budget of 17000 Naira per person, Oceans5 by Riviera could be worth a visit. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Orile Lekki",
    "tag": "Orile Lekki - Lekki Phase I: Good atmosphere, tasty food, reasonably priced, small portions, with a budget of 20000 Naira per person, located on the island.",
    "summary": "Orile Lekki in Lekki Phase I has a good atmosphere and friendly staff. The food is reportedly tasty and reasonably priced, though the portions are said to be small. While it may not be the best option for those with a big appetite, Orile Lekki could be worth a visit for those looking for a nice atmosphere and good value for money. The restaurant is located on the island and has a budget of 20000 Naira per person."
  },
  {
    "restaurantName": "OX Restaurant & Lounge",
    "tag": "OX in Victoria Island: Beautiful and modern ambience, with an average service. Expect to pay around 32000 Naira per person, located on the island.",
    "summary": "OX Restaurant & Lounge in Victoria Island boasts a beautiful and modern ambience, with an elegant and welcoming interior and a spacious and comfortable outdoor seating area. However, the food and drinks did not meet expectations, with dishes lacking flavor and some being overcooked, while the drinks were not impressive. The service was average, with some staff being friendly while others were disinterested. Expect to pay around 32000 Naira per person for the experience, and keep in mind that it's located on the island."
  },
  {
    "restaurantName": "Pitstop Lagos",
    "tag": "Pitstop Lagos - VI (Victoria Island): Cozy ambiance, decent food, good service, with an average budget of 15000 Naira per person, located on the island.",
    "summary": "Pitstop Lagos is a casual dining restaurant in Victoria Island, Lagos. With a cozy ambiance and indoor and outdoor seating options, the restaurant offers a variety of dishes ranging from local to continental cuisines. While the food is decent and some dishes are well-prepared and flavorful, others fall short of expectations. The service is prompt and courteous, and the staff is attentive to the needs of customers. If you're looking for a casual dining experience with decent food and good service, then Pitstop Lagos might be worth a visit. The restaurant offers an average budget of 15000 Naira per person and is conveniently located on the island."
  },
  {
    "restaurantName": "Placebo Restaurant & Bar",
    "tag": "Placebo Magodo in GRA Phase 2 on the mainland: Nice ambience and decor, decent food, prices on the higher side, budget of 18000 Naira per person.",
    "summary": "Placebo Restaurant & Bar in Magodo GRA Phase 2 on the mainland is known for its nice ambience and decor, and the food is decent with the chicken wings and pepper soup being highly recommended. However, the service is slow and the prices are a bit high, with a budget of 18000 Naira per person. If you're looking for a restaurant with a nice atmosphere and decent food, Placebo Magodo may be worth a visit."
  },
  {
    "restaurantName": "Plan.taine",
    "tag": "Plan.taine Lagos - VI (Victoria Island): Modern decor, vegetarian options, attentive service, with prices on the higher side, budget of 30000 Naira per person, located on the island.",
    "summary": "Plan.taine in Victoria Island offers a modern decor, vegetarian options, and attentive service. The restaurant's menu features a variety of dishes, including vegetarian options, which are well-presented and of good quality. However, it is noted that the prices are on the higher side with a budget of 30000 Naira per person. If you're looking for a restaurant with a nice atmosphere, good food, and vegetarian options, Plan.taine Lagos may be worth a visit. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Sketch Restaurant & Cafe",
    "tag": "Sketch Lagos - VI (Victoria Island): Chic atmosphere with fusion cuisine and high prices, good quality food, attentive service, budget of 30000 Naira per person, located on the island.",
    "summary": "Sketch Restaurant & Cafe in Victoria Island offers a chic and trendy atmosphere with unique decor and an interesting menu that fuses different cuisines. The presentation of the food is impressive, and the service is attentive and prompt. However, the prices are on the high side, but the quality of the food justifies it. If you're looking for a unique dining experience with good food and service, Sketch Restaurant & Cafe may be worth a visit for those with a budget of 30000 Naira per person. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Slice",
    "tag": "Slice Victoria Island: Heavenly pizzas, top-notch drinks, beautiful ambience, excellent service, high prices, with a budget of 35000 Naira per person, located on the island.",
    "summary": "Slice Victoria Island is known for its heavenly pizzas and top-notch drinks. The restaurant has a beautiful ambience with excellent service, and the prices are reasonable. If you're looking for a great dining experience on the island, Slice Victoria Island is definitely worth a visit with a budget of 35000 Naira per person."
  },
  {
    "restaurantName": "Thai Thai",
    "tag": "Thai Thai Lagos - VI (Victoria Island): Vibrant and colourful atmosphere, flavourful Thai cuisine, with friendly and prompt service. Portion sizes are small for the price, budget of 22000 Naira per person, located on the island.",
    "summary": "Thai Thai in Victoria Island offers a lively and colourful atmosphere that sets the tone for an exciting dining experience. The menu offers a range of Thai dishes with a decent selection of vegetarian options. The Pad Thai and Tom Yum soup are particularly tasty, and the service is friendly and prompt. However, it should be noted that the portion sizes are a bit small for the price. Overall, if you're in the mood for a fun and flavourful Thai meal, Thai Thai is worth a visit. With a budget of 22000 Naira per person and located on the island, it's a convenient option for diners in the area."
  },
  {
    "restaurantName": "THE OBSERVATORY",
    "tag": "THE OBSERVATORY in Lekki Phase One: A modern and trendy restaurant with a lovely atmosphere and serene outdoor seating. The food and drinks, while pricey, are below average in taste and quality, with poorly mixed cocktails and under-seasoned dishes. The service is average, but the ambiance makes it a decent spot for hanging out with friends or hosting a small gathering. A budget of 15000 Naira per person is recommended.",
    "summary": "If you're looking for a modern and trendy spot to hang out with friends or host a small gathering, THE OBSERVATORY in Lekki Phase One may be worth a visit. The restaurant's lovely atmosphere and serene outdoor seating provide a relaxing ambiance. However, the food and drinks are below average in taste and quality, with poorly mixed cocktails and under-seasoned dishes. The service is average, but the prices are on the higher side. Overall, a budget of 15000 Naira per person is recommended for a decent experience."
  },
  {
    "restaurantName": "The Seetle",
    "tag": "The Seetle - Ikoyi: Chic ambiance with a variety of African and continental cuisine at slightly high prices, with a budget of 15000 Naira per person, located on the island.",
    "summary": "The Seetle in Ikoyi offers a chic ambiance with a modern and stylish decor, and serves a variety of dishes ranging from African to continental cuisine. Although some of the dishes were not as flavorful as expected and the portion sizes were small for the prices charged, the restaurant is worth a visit for those looking for a decent meal in a chic setting. The Seetle has a slightly high price point with a budget of 15000 Naira per person and is located on the island."
  },
  {
    "restaurantName": "The Shark Express",
    "tag": "The Shark Express - Lekki Phase 1: Affordable seafood, casual atmosphere, efficient service, lacking in decor, with a budget of 20000 Naira per person, located on the island.",
    "summary": "The Shark Express in Lekki Phase 1 is a casual seafood restaurant with affordable prices and generous portions. The atmosphere is relaxed, and the service is efficient, although the decor could use some improvement. Overall, if you're in the mood for some decent seafood at an affordable price, The Shark Express is worth a visit. With a budget of 20000 Naira per person, it's a great option for those on the island."
  },
  {
    "restaurantName": "The Shed",
    "tag": "The Shed Lekki - A trendy and warm atmosphere with efficient service, great grilled meats and seafood, delicious cocktails, with a higher price point of 27000 Naira per person, located on the island.",
    "summary": "The Shed Lekki is a trendy and inviting restaurant with efficient service and a focus on grilled meats and seafood. The food is well-prepared and flavorful, and the cocktails are well-crafted and delicious. While the prices are on the higher side with a budget of 27000 Naira per person, the warm atmosphere and great dining experience make it worth the visit. Located on the island, The Shed Lekki is a convenient option for diners in that area."
  },
  {
    "restaurantName": "Turaka",
    "tag": "Turaka Lagos - VI (Victoria Island): Vibrant and welcoming African restaurant with delicious food, attentive service, and a warm and inviting ambiance, with a budget of 23000 Naira per person and located on the island.",
    "summary": "Turaka is a vibrant and welcoming African restaurant located in Victoria Island. The restaurant has a beautiful decor that creates a warm and inviting ambiance. The menu offers a variety of well-prepared and flavorful dishes with an African twist. The service is also commendable, with attentive and friendly staff who are always ready to assist. If you're looking for a delightful dining experience, Turaka is worth a visit with a budget of 23000 Naira per person. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Woks at Blowfish",
    "tag": "Woks at Blowfish - VI (Victoria Island): Modern and chic decor, reasonable prices, Asian-inspired dishes, with some noise and slow service issues, budget of 12000 Naira per person, located on the island.",
    "summary": "Woks at Blowfish in Victoria Island offers a modern and chic decor that creates a relaxing atmosphere, and serves up flavorful Asian-inspired dishes at reasonable prices. However, there may be some issues with slow service and noise during peak hours. Overall, if you're looking for a trendy Asian cuisine experience on the island with a budget of 12000 Naira per person, Woks at Blowfish is worth a visit."
  },
  {
    "restaurantName": "Ziya Delicacy Boutique",
    "tag": "Ziya Delicacy Boutique in Victoria Island: A fusion of African and Middle Eastern cuisine, warm and inviting ambiance, beautifully presented dishes, perfect for a special occasion or a date night, with a budget of 17000 Naira per person, located on the island.",
    "summary": "Ziya Delicacy Boutique in Victoria Island offers a unique dining experience with a fusion of African and Middle Eastern cuisine. The warm and inviting ambiance, coupled with the beautiful decor, complements the well-prepared and flavorful dishes that are beautifully presented, making it a great place for a special occasion or a date night. The staff are friendly and attentive, ensuring that all your needs are met. With a budget of 17000 Naira per person, Ziya Delicacy Boutique is worth a visit for those looking for a memorable dining experience. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Zen2go",
    "tag": "Zen2Go - VI (Victoria Island): A unique fusion of Asian and Nigerian cuisine in a modern and welcoming atmosphere with friendly service and prices averaging 22000 Naira per person.",
    "summary": "Zen2go in Victoria Island offers a unique and refreshing dining experience with its fusion of Asian and Nigerian cuisine. The restaurant has a modern and welcoming atmosphere with an open kitchen that adds to the dining experience. The food is well-prepared, flavorful, and presented beautifully, while the service is friendly and attentive. Although the prices are a bit on the high side, the quality of the food and service make it worth it. Located on the island, Zen2go is an excellent option for those with a budget averaging 22000 Naira per person."
  },
  {
    "restaurantName": "RSVP Lagos",
    "tag": "RSVP Lagos - VI (Victoria Island): Warm and modern ambiance, flavorful food, and attentive service, with a budget of 20000 Naira per person, located on the island.",
    "summary": "RSVP Lagos in Victoria Island is a must-visit restaurant known for its warm and modern ambiance, flavorful food, and attentive service. The dishes are well-prepared, flavorful, and beautifully presented, making it a great place for a special occasion or a date night. The staff are friendly and attentive, making sure that all your needs are met. With a budget of 20000 Naira per person, it is one of the higher-priced restaurants in Lagos, but it is worth it for the quality of food and service. It is recommended to reserve a table before making the trip, as it is a popular spot. Located on the island, it is a convenient option for diners in that area."
  },
  {
    "restaurantName": "Z Kitchen",
    "tag": "Z Kitchen - VI (Victoria Island): Beautiful ambiance, extensive menu, slightly pricey but with good food, a budget of 20000 Naira per person, located on the island.",
    "summary": "Z Kitchen in Victoria Island offers a beautiful ambiance with natural lighting and an extensive menu. While slightly on the pricey side, the restaurant delivers good food, making it a great option for a special occasion or a date night. However, it's recommended to make a reservation before visiting. The staff are super nice and courteous, although the service might be a bit slow. Overall, Z Kitchen is worth a visit for those with a budget of 20000 Naira per person. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "The Harvest",
    "tag": "The Harvest - Lekki Phase 1 (Admiralty Way): Rustic ambience, solid pricing for food, staff coordination can be improved, budget of 15000 Naira per person, located on the island.",
    "summary": "The Harvest in Lekki Phase 1 is known for its rustic ambience and solid pricing for food. The restaurant offers a clean and spacious environment, but the staff coordination could be improved to reduce waiting time. Overall, if you're looking for a restaurant with a pleasant minimalistic ambience and decent pricing, The Harvest is worth a visit with a budget of 15000 Naira per person. Located on the island, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Panarottis Admiralty Lagos",
    "tag": "Panarottis Admiralty Lagos in Lekki Phase 1 offers delicious and affordable Italian food with great specials and play area facilities for kids. With friendly staff and an average service time, it's a great spot for a family dinner or casual meal with friends. A budget of 10000 Naira per person is reasonable.",
    "summary": "If you're looking for a family-friendly restaurant with affordable Italian food in Lagos, Panarottis Admiralty Lagos in Lekki Phase 1 is a great option. The restaurant offers delicious pizza and pasta options that are easy on the pocket and enjoyable for the taste buds. With friendly staff and an average service time, it's a great spot for a family dinner or casual meal with friends. The restaurant also has play area facilities for kids, making it a good option for families. With a budget of 10000 Naira per person, it's a great value for your money. Located in Delakes Mall in Lekki Phase 1 on the island."
  },
  {
    "restaurantName": "Olaiya",
    "tag": "Olaiya Surulere: No-frills ambience but great-tasting, affordable local food with prompt service, a must-visit spot for swallow lovers on a tight budget, located on the mainland.",
    "summary": "Olaiya in Surulere is a must-visit spot for those looking for great-tasting, affordable local food with prompt service on the mainland. The restaurant's no-frills ambience may not be impressive, but the star of the show is the delightful bowl of amala and ewedu/gbegiri soup, along with other pounded yam and rice-based meals. Olaiya is a go-to place for swallow lovers on a tight budget, with prices starting from 1000 Naira per person. Located on the mainland, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Amoke Oge",
    "tag": "Amoke Oge - Somolu: Authentic buka experience with delicious traditional food, prompt service, and a budget of 1500 Naira per person, located on the mainland.",
    "summary": "If you're looking for an authentic buka experience on the mainland, specifically in shomolu, Amoke Oge is a great option. They offer a wide range of traditional foods, with their jollof rice and swallow being particularly noteworthy. While the ambience is not a priority, the prompt service makes up for it. With a budget of 1500 Naira per person, Amoke Oge is a great option for those looking for affordable and delicious local food. Located on the mainland, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Commint Buka",
    "tag": "Commint Buka - Surulere: Popular buka with quality food and friendly staff but slightly higher pricing than contemporaries, budget of 2500 Naira per person, located on the mainland.",
    "summary": "Located in Surulere, Commint Buka is a popular option for quality buka food. Despite slightly higher pricing than other bukas in the area, the food is worth it. Their pounded yam with any soup and protein of your choice is highly recommended. The staff are friendly and parking may be a hassle. With a budget of 2500 Naira per person, it's a good option for those looking for a quick buka meal on the mainland."
  },
  {
    "restaurantName": "University of Suya",
    "tag": "University of Suya in Ikeja is notorious for its signature spice mix and well-packaged street suya experience, with prices around 2000 Naira per person and located on the mainland.",
    "summary": "University of Suya is one of the hottest suya spots on the mainland, located in Ikeja. Their signature spice mix and well-packaged street suya experience have made them stand out from others in the area. Although notorious, this is in a good way as they have built a reputation for being one of the best. Prices are around 2000 Naira per person, and the location is convenient for those on the mainland looking for a suya spot."
  },
  {
    "restaurantName": "Korede Spaghetti",
    "tag": "Korede Spaghetti - Surulere, Akoka: Quick fast food with reasonable pricing, famous for spaghetti but the nimota and suya rice mix is a must-try, with a budget of 2500 Naira per person, located on the mainland.",
    "summary": "Korede Spaghetti is a popular fast food restaurant on the mainland, specifically in lagos known for their reasonable pricing and quick service. While their spaghetti is their main selling point, customers rave about their nimota and suya rice mix. With a budget of 2500 Naira per person, Korede Spaghetti is a great option for those looking for a satisfying meal without breaking the bank. Overall, the restaurant has received positive reviews and is a must-try for anyone in the area. Located on the mainland, it's a convenient option for diners in that area."
  },
  {
    "restaurantName": "Ocean Basket",
    "tag": "Ocean Basket - VI (Victoria Island): Premier seafood destination with warm ambiance, delicious platters, sushi, and cocktails. Recommended budget of 15000 Naira per person, located on the island.",
    "summary": "Ocean Basket in Victoria Island is a premier seafood destination that offers delicious platters that can feed several people. The jollof rice in the platters is also highly recommended. In addition to seafood, their sushi and cocktails are also worth a try. The ambiance is warm and lovely, and the staff are warm and friendly. The restaurant is located on the island and has adequate parking space. However, it's important to note that the prices are on the higher side, with a recommended budget of 15000 Naira per person."
  },
  {
    "restaurantName": "Burg",
    "tag": "Burg Ikeja - GRA: Delicious burgers and more at great value for money, with a budget of 5000 Naira per person, located on the mainland.",
    "summary": "Burg in Ikeja GRA is a must-try for burger lovers on the mainland. Their Burg Spike is a personal favorite but all options are worth a taste. The smoothies and milkshakes could be improved, but considering the value for money, it's still worth it. Though currently only offering delivery, the indoor area is usually fun with games and tennis tables. With a budget of 5000 Naira per person, Burg is a great option for those looking for delicious food that won't break the bank. Located on the mainland, it's a convenient spot for diners in that area."
  },
  {
    "restaurantName": "Gypsys Restaurant and Bar",
    "tag": "Gypsys Ilupeju - the best Indian restaurant in Lagos with generous portions, attentive staff and great value for money, located on the mainland with a budget of 10000 Naira per person.",
    "summary": "Gypsys Restaurant and Bar in Ilupeju is a top-rated Indian restaurant that is known for its generous portions, quick and attentive staff, and great value for money. It is widely regarded as the best Indian restaurant not just on the mainland, but in the whole of Lagos. The restaurant has a budget of 10000 Naira per person, making it a great option for those looking for quality food at a reasonable price. With its location on the mainland, Gypsys is easily accessible and definitely worth a visit for anyone looking for a great Indian dining experience."
  },
  {
    "restaurantName": "White House Restaurant",
    "tag": "White House Restaurant - Yaba: Get that proper buka feel on the Mainland with their delicious jollof, an attractive pricing of 1500 Naira per person, though the dining area could use some improvement.",
    "summary": "If you're looking for an authentic buka experience on the Mainland, White House Restaurant in Yaba is worth considering. Their delicious jollof is a standout dish and the pricing is attractive at 1500 Naira per person. However, the dining area may not be the most appealing. If you're okay with a casual atmosphere and don't mind a few imperfections, White House is a great option for quick, decent food."
  },
  {
    "restaurantName": "Cactus Restaurant",
    "tag": "Cactus Lagos - VI (Victoria Island): A Lagos OG known for consistently good food, wide menu options including pizza and burgers, a play area for kids, outdoor seating, and prices averaging around 15000 Naira per person.",
    "summary": "Cactus is a well-known restaurant in Lagos, located in Victoria Island. Known for consistently good food, the restaurant has a wide-ranging menu with options like great pizzas, delightful burgers, and strong salad choices. They also have a useful kids menu, as well as a play area to keep children entertained. Whether you prefer the outdoor setting or indoor, the staff are orderly and courteous. Prices average around 15000 Naira per person, making it a bit on the pricier side but a worthwhile experience overall. If you're looking for a restaurant with great food, outdoor seating, and a play area for kids, Cactus is a good option."
  }
]
