[
  {
    "restaurantName": "Room Cafe",
    "tag": "Room Cafe - VI, Lagos: Chic ambiance, delicious food and drinks, with room for service improvement; budget of 30000/person, located on the island",
    "summary": "The Room Cafe, located at 190b Prince Ade Odedina Street in Victoria Island, offers a lovely atmosphere with modern and stylish decor. The food is enjoyable with a good variety of dishes, and the drinks are well made. However, the service can be slow and could use some improvement. Overall, if you're looking for a nice place to grab a bite and relax, the Room Cafe is definitely worth considering, and it's budget-friendly at 30000 Naira per person. Being located on the island adds to its appeal as a dining option in Lagos. Contact them at 0908 285 1609.",
    "review": "The Room Cafe in Victoria Island offers a lovely atmosphere with a modern and stylish decor. The food was enjoyable with a good variety of dishes to choose from, and the drinks were well made. However, the service was a bit slow and could use some improvement. Overall, if you're looking for a nice place to grab a bite and relax, the Room Cafe is definitely worth considering."
  },
  {
    "restaurantName": "Smalliez Diner ",
    "tag": "Smalliez Diner - Victoria Island: Vibrant atmosphere, generous portions, friendly service, budget of 20000/person, located on the island.",
    "summary": "Located in the heart of Victoria Island, Smalliez Diner is a must-visit for those seeking a vibrant and inviting atmosphere for a casual dining experience. With a diverse menu that includes mouthwatering burgers and flavorful pasta dishes, Smalliez Diner offers generous portions that are sure to satisfy even the heartiest appetite. The service is prompt and friendly, enhancing the overall dining experience. However, some diners have noted that a few of the dishes were under-seasoned and lacked the wow factor. Despite this, Smalliez Diner remains a budget-friendly option, with an average cost of 20000 Naira per person. Situated on the island, it's a convenient choice for locals and tourists alike who are looking for a laid-back spot to enjoy a meal with friends or loved ones."
  },
  {
    "restaurantName": "Safron Restaurant ",
    "tag": "Saffron Restaurant - Ikeja: Pleasant dining experience, lovely ambience, well-prepared food, friendly service; budget of 30000/person, located on the mainland.",
    "summary": "Located in the bustling Ikeja GRA, Saffron Restaurant offers a delightful dining experience with its charming ambience and stylish decor. The service is prompt and friendly, ensuring a seamless dining experience from start to finish. The menu at Saffron Restaurant boasts a good variety of dishes to cater to different tastes, and the well-prepared food is bursting with flavor, with generous portions that are sure to satisfy even the hungriest of diners. The drinks selection is also noteworthy, with a decent array of wines and cocktails to complement your meal. With a budget-friendly average cost of 30000 Naira per person, Saffron Restaurant is a top choice for those looking for a high-quality dining experience without breaking the bank. Plus, being located on the mainland in Ikeja, it's a convenient option for both locals and visitors to explore the culinary offerings of Lagos. Don't miss out on the chance to dine at Saffron Restaurant and indulge in its delicious cuisine and welcoming atmosphere! "
  },
  {
    "restaurantName": "Taj Restaurant | Bar",
    "tag": "Taj Restaurant & Bar - VI, Lagos: Modern ambience, friendly staff, generous portions; budget of 24000/person, located on the island.",
    "summary": "Situated in the bustling Victoria Island, Taj Restaurant & Bar offers a dining experience with a modern and elegant ambience that is sure to impress. The restaurant's decor is lovely, creating a welcoming atmosphere for diners. The menu at Taj Restaurant & Bar is diverse, offering a variety of Indian, Chinese, and continental dishes to satisfy different palates. The portions are generous, ensuring you won't leave hungry. The staff are friendly, attentive, and always willing to assist, adding to the overall positive dining experience. However, while the food is decent, it may not meet the high expectations of those seeking authentic Indian cuisine, as some dishes lacked the expected flavors. The drinks are average, with cocktails that were not particularly impressive. With an average cost of 24000 Naira per person, Taj Restaurant & Bar is a budget-friendly option for those looking to dine on the island in Victoria Island. Despite some minor shortcomings, Taj Restaurant & Bar is worth a visit for a decent dining experience in a modern and welcoming setting."
  },
  {
    "restaurantName": "Placebo Restaurant & Bar",
    "tag": "Placebo Restaurant & Bar - Magodo: Nice ambience, decent food with highlights on chicken wings and pepper soup, budget of 18000/person, located on the mainland.",
    "summary": "Placebo Restaurant & Bar in Magodo offers a nice ambience and decor, with the reviewer mentioning that the food is decent, particularly highlighting the chicken wings and pepper soup. However, the service was reported to be slow and the prices were considered slightly high at 18000 Naira per person. Despite these issues, if you're looking for a nice atmosphere and decent food, Placebo Restaurant & Bar in Magodo may still be worth a visit. It is located on the mainland."
  },
  {
    "restaurantName": "Gusto",
    "tag": "Gusto - VI, Lagos: Stylish interior, diverse menu, reasonable pricing, but average food quality; budget-friendly at 25000/person, located on the island",
    "summary": "Gusto in Victoria Island offers a stylish and spacious interior with modern decor, and a diverse menu featuring Italian classics and fusion cuisine. The service is prompt and attentive, and the pricing is reasonable. However, the food quality is average, with some dishes lacking in flavor due to being under-seasoned. Overall, while the atmosphere and service are commendable, the food may not live up to expectations for some diners. Nevertheless, it can still be considered as a budget-friendly option for dining out at 25000 Naira per person, especially for those looking for a trendy spot on the island."
  },
  {
    "restaurantName": "Kaanubaru",
    "tag": "Kaanubaru - Gbagada: Tasty well-seasoned food, prompt service, nice decor and ambiance, budget of 30000/person, located on the mainland.",
    "summary": "Kaanubaru in Gbagada is praised for its tasty and well-seasoned food, prompt and attentive service, and nice decor and ambiance. With a budget of 30000 Naira per person, Kaanubaru offers a good dining experience for those looking for a restaurant on the mainland. The reviewer's positive feedback makes it a compelling option to consider for your dining needs in Gbagada."
  },
  {
    "restaurantName": "343 Degrees North",
    "tag": "343 Degrees North - Victoria Island: Pleasant atmosphere with a view, but food quality and service need improvement; budget at 20000/person, located on the island.",
    "summary": "343 Degrees North Restaurant in Victoria Island offers a pleasant atmosphere with a beautiful view, but the review notes that the food quality was not up to par, particularly the seafood which was overcooked, and the cocktails were not well-made. Additionally, the service was reported to be slow. With a budget of 20000 Naira per person, it may be best to consider other dining options in the area. The restaurant is located on the island."
  },
  {
    "restaurantName": "Avant Garde by Soul Chow",
    "tag": "Avant Garde by Soul Chow - Ikoyi: Stylish interior, well-presented food, attentive service, budget of 35000/person, located on the island.",
    "summary": "Avant Garde by Soul Chow in Ikoyi offers a modern and stylish dining experience with well-presented food, attentive service, and a variety of menu options. However, the prices are on the higher side at 35000 Naira per person. If you're looking for a chic and trendy restaurant on the island, Avant Garde by Soul Chow is worth considering."
  },
  {
    "restaurantName": "Bamboo Lounge and Guest House",
    "tag": "Bamboo Lounge and Guest House - Ikeja GRA: Great spot for drinks and chill vibe, impressive ambience with lovely outdoor seating, food could use improvement, budget of 7500/person, located on the mainland.",
    "summary": "Bamboo Lounge and Guest House in Ikeja GRA offers a great spot for drinks and a chill vibe, with an impressive ambience and lovely outdoor seating area. However, the food could use some improvement in terms of seasoning and cooking. The drinks are decent but not exceptional, and the service can be slow. Despite these shortcomings, if you're looking for a place to hang out and have drinks with friends, Bamboo Lounge and Guest House may be worth a visit, especially with a budget of 7500 Naira per person. Located on the mainland, it offers a convenient option for those in the Ikeja GRA area."
  },
  {
    "restaurantName": "Black Olive",
    "tag": "Black Olive - Ikoyi: Pleasant atmosphere with modern decor, comfortable seating, variety of options, budget of 15000/person, located on the island.",
    "summary": "Black Olive in Ikoyi offers a pleasant atmosphere with modern decor and comfortable seating arrangements. The restaurant has a variety of options to choose from, making it a good choice for diners looking for a diverse menu. The budget is 15000 Naira per person, and the restaurant is located on the island."
  },
  {
    "restaurantName": "Black Pepper Steakhouse",
    "tag": "Black Pepper Steakhouse - Eko Atlantic: Modern and sophisticated ambience, good service, inconsistent food quality, limited menu options, budget of 38000 Naira per person, located on the island.",
    "summary": "Black Pepper Steakhouse at Eko Atlantic Pearl offers a modern and sophisticated ambience with good service, although food quality can be inconsistent and menu options are limited. With a budget of 38000 Naira per person, it is a recommended option for a fancy dining experience on the island, but be prepared for potential hit-or-miss dishes according to the reviewer's feedback."
  },
  {
    "restaurantName": "CAFE DE FLORE",
    "tag": "CAFE DE FLORE - Ikoyi: Beautiful atmosphere, French-inspired menu, well-prepared food, efficient service, budget of 20000/person, located on the island.",
    "summary": "Cafe de Flore in Ikoyi, Lagos is known for its beautiful and inviting atmosphere, French-inspired menu, well-prepared food, and efficient service. Despite some dishes being overpriced and portion sizes not being generous, it is still worth considering for a pleasant and relaxed dining experience on the island, especially if you have a budget of 20000 Naira per person."
  },
  {
    "restaurantName": "Ci Gusta",
    "tag": "Ci Gusta - Victoria Island: Beautiful decor, delicious Italian cuisine, generous portions, prompt service, high prices, budget of 30000/person, located on the island.",
    "summary": "Ci Gusta in Victoria Island is a beautiful Italian restaurant with delicious and well-prepared food, generous portions, and prompt service. However, the prices are on the higher side and the outdoor seating area may not be very comfortable. Despite that, it's worth considering for a nice dining experience if you're looking for Italian cuisine on the island, with a budget of 30000 Naira per person."
  },
  {
    "restaurantName": "Cilantro",
    "tag": "Cilantro - Victoria Island: Indian restaurant with pleasant ambiance and comfortable seating, budget of 12000/person, located on the island",
    "summary": "Cilantro, located in Victoria Island, is an Indian restaurant with lovely decor, comfortable seating, and decent service. However, the food, including the chicken tikka masala and naan bread, was not up to expectations in terms of flavor and freshness. Additionally, the wait time for the food was too long. With a budget of 12000 Naira per person, Cilantro may be worth a visit for its ambiance, but the food quality could be improved according to the reviewer's feedback."
  },
  {
    "restaurantName": "Crust Cafe",
    "tag": "Crust Cafe - Lekki: Casual and welcoming atmosphere, variety of dishes including sandwiches, salads, and pastries, reasonable prices and generous portions, budget of 12000/person located on the island.",
    "summary": "Crust Cafe in Lekki offers a casual and welcoming atmosphere, with a variety of dishes including sandwiches, salads, and pastries, at reasonable prices and generous portions. Although service may be slow during peak hours, it's a great spot for a relaxed and laid-back dining experience in Lekki Phase I."
  },
  {
    "restaurantName": "CREPAWAY",
    "tag": "CREPAWAY - Victoria Island: Nice ambience, trendy decor, decent food, friendly service, reasonable prices, located on the island with a budget of 15000/person.",
    "summary": "CREPAWAY in Victoria Island offers a nice ambience with trendy decor, serves decent food with friendly service, and reasonable prices. Located on the island with a budget of 15000 Naira per person, it could be a good casual dining spot for those looking for a restaurant with a good vibe."
  },
  {
    "restaurantName": "HOV Lounge",
    "tag": "HOV Lounge - Lekki Phase I: Pleasant ambiance, but subpar food and drinks, slow service, budget of 30000/person, located on the island.",
    "summary": "HOV Lounge in Lekki Phase I offers a pleasant ambiance, but the quality of food and drinks may not meet expectations, with overcooked seafood, poorly made cocktails, and slow service. It may be worth considering for the ambiance, but other options may be preferable if food and drinks are a priority. The budget is around 30000 Naira per person, and it is located on the island."
  },
  {
    "restaurantName": "Godaïf Village",
    "tag": "Godaïf Village - Ikoyi: Nice ambiance and decor, friendly staff, concerns about food quality, budget of 20000 Naira/person, located on the island.",
    "summary": "Godaïf Village, located in Ikoyi, is praised for its nice ambiance and decor, as well as friendly and attentive staff. However, there are concerns about food quality with some dishes being underwhelming and lacking flavor, and prices being on the higher side. If you prioritize ambiance and decor over food quality, Godaïf Village could be worth a visit within a budget of 20000 Naira per person, but if food quality is a top priority for you, you may want to consider other options."
  },
  {
    "restaurantName": "HSE Gourmet",
    "tag": "HSE Gourmet - Lekki Phase I: Classy ambiance, underwhelming food, average service, budget of 40000/person, located on the island.",
    "summary": "HSE Gourmet in Lekki Phase I is known for its classy and elegant ambiance, but the food may be underwhelming with lacking flavors and poorly made cocktails. The service is average, and the budget is around 40000 Naira per person. It is located on the island, and if you prioritize ambiance over food quality, HSE Gourmet may be worth considering for your dining experience in Lekki Phase I."
  },
  {
    "restaurantName": "ILÉ EROS",
    "tag": "ILÉ EROS - Lekki Phase I: Unique dining experience with beautiful decor and ambiance, Average food quality, prompt service, budget of 15000/person, located on the island.",
    "summary": "ILÉ EROS in Lekki Phase I offers a unique dining experience with its beautiful decor and ambiance, although the food quality was average during our visit. The service was prompt and attentive, but prices were on the higher side. With a budget of 15000 Naira per person, ILÉ EROS could be worth a try for those looking for a restaurant with a good ambiance on the island."
  },
  {
    "restaurantName": "Indigo Bar Restaurant & Suite",
    "tag": "Indigo Bar Restaurant & Suite - Victoria Island: Modern and chic decor, impressive menu selection, well-prepared food, extensive drinks menu, attentive service, budget of 20000/person, located on the island.",
    "summary": "Indigo Bar Restaurant & Suite in Victoria Island offers a modern and chic ambiance, an impressive menu selection, well-prepared and delicious food, an extensive drinks menu, and attentive service. With a budget of 20000 Naira per person, it is a great option for those looking for a good dining experience in Victoria Island."
  },
  {
    "restaurantName": "Kaly Restaurant & Bar Lounge",
    "tag": "Kaly Restaurant & Bar Lounge - Victoria Island: Great atmosphere, delicious food, well-made drinks, prompt service, located on the island with a budget of 50000 Naira per person.",
    "summary": "Kaly Restaurant & Bar Lounge in Victoria Island offers a great atmosphere with an outdoor seating area that offers a nice view. The food, particularly the grilled chicken, is delicious, and the drinks are well-made. The service is prompt and attentive, making it a good choice for a nice spot to hang out with friends or have a casual date. With a budget of 50000 Naira per person, Kaly is a good option for those looking for a restaurant on the island."
  },
  {
    "restaurantName": "Ki Bar & Kitchen",
    "tag": "Ki Lagos - Victoria Island: Pleasant ambiance, flavorful food, attentive service, with prices on the higher side, budget of 16000 Naira/person, located on the island.",
    "summary": "Ki Lagos in Victoria Island is known for its pleasant ambiance, flavorful food, and attentive service. The restaurant offers a comfortable seating arrangement with an impressive decor, and the food is well-presented and of good quality. However, it is noted that the prices are on the higher side. If you're looking for a restaurant with a nice atmosphere and good food, Ki Lagos may be worth a visit for those with a budget of 16000 Naira per person. Located on the island, it's a convenient option for diners in that area."
  }
]
